app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @all_ratings = Movie.get_ratings

    ratings = Hash.new
    @all_ratings.each { |rating| ratings[rating] = 1 }